* Layout

#+name: layout
#+begin_example keymap :tangle layout.txt
 ╭────────────────────────────────────────────────────────────────╮
 │TAB   q    w    e    r    t        y    u    i    o    p    BS  │
 │CTL   a    s    d    f    g        h    j    k    l    :;   RET │
0│SFT   z    x    c    v    b        n    m    ,    .    /    ;   │
 │                    M₄   M₅        3   CTL                      │
 │          OPT  CMD  M₁   M₃       SFT   ␣   M₂    ◌             │
 ╰────────────────────────────────────────────────────────────────╯
 ╭────────────────────────────────────────────────────────────────╮
 │ ~    !    @    #    $    %        ^    7    8    9    ◌    ◌   │
 │ ◌    "    &    *    _    0        +    4    5    6    '    |   │
1│ ◌    ◌    ◌    ◌    ◌    .        0    1    2    3    /    ◌   │
 │                     ◌    ◌        ◌    ◌                       │
 │          OPT  CMD   ◉    ◌        ◌    ␣    ◌    ◌             │
 ╰────────────────────────────────────────────────────────────────╯
 ╭────────────────────────────────────────────────────────────────╮
 │ `    ◌    ◌    ◌    ◌    ◌        ◌    ◌    ◌    ◌    ◌    BS  │
 │ ◌    [    ]    (    )    ◌        ◌    -    =    ◌    ◌    \   │
2│ ◌    <    >    {    }    ◌        ◌    ◌    ◌    ◌    ◌    ◌   │
 │                     ◌    ◌        ◌    ◌                       │
 │          OPT  CMD   ◌    ◌        ◌    ◌    ◉    ◌             │
 ╰────────────────────────────────────────────────────────────────╯
 ╭────────────────────────────────────────────────────────────────╮
 │ESC  λ←   λ→   ¶←   ¶→    ◌        ◌   P↑    ↑   P↓    ◌   UND  │
 │ ◌   S←   S→   W←   W→   BEG       ◌    ←    ↓    →    ◌    ◌   │
3│ ◌    ◌    ◌    ◌    ◌    ◌        ◌   HME   ◌   END   ◌    ◌   │
 │                     ◌    ◌        ◌    ◌                       │
 │          OPT  CMD  M₁    ◉        ◌    ◌    ◌    ◌             │
 ╰────────────────────────────────────────────────────────────────╯
 ╭────────────────────────────────────────────────────────────────╮
 │ ◌    F1   F2   F3   F4   F5      F6   F7   F8   F9   F10  KIL  │
 │ ◌    ∫C   ∫D   ∫S   ∫E   ∫P      Bu0  Bu1  Bu2  Bu3   ◌   SAV  │
4│ ◌    ◌    ◌    ◌    ◌    ◌        ◌    ◌    ◌    ◌    ◌    ◌   │
 │                     ◉    ◌        ◌    ◌                       │
 │          OPT  CMD   ◌   M₆!       ◌    ◌    ◌    ◌             │
 ╰────────────────────────────────────────────────────────────────╯
 ╭────────────────────────────────────────────────────────────────╮
 │ ◌    ◌    ◌    ◌    ◌    ◌        ◌    ◌    ◌    ◌    ◌    ◌   │
 │ ◌    ◌    ◌    ◌    ◌    ◌        ◌    ◌    ◌    ◌    ◌    ◌   │
5│ ◌    ◌    ◌    ◌    ◌    ◌        ◌    ◌    ◌    ◌    ◌    ◌   │
 │                     ◌    ◌        ◌    ◌                       │
 │          OPT  CMD   ◌    ◌        ◌    ◌    ◌    ◌             │
 ╰────────────────────────────────────────────────────────────────╯
 ╭────────────────────────────────────────────────────────────────╮
 │ ◌    ◌    ◌    ◌    ◌    ◌        ◌    ◌    ◌    ◌    ◌    ◌   │
 │ ◌   BT4  BT3  BT2  BT1  BTC       ◌    ◌    ◌    ◌    ◌    ◌   │
6│ ◌    ◌    ◌    ◌    ◌    ◌        ◌    ◌    ◌    ◌    ◌    ◌   │
 │                     ◌    ◌        ◌    ◌                       │
 │          OPT  CMD   ◌    ◉        ◌    ◌    ◌    ◌             │
 ╰────────────────────────────────────────────────────────────────╯
 ╭────────────────────────────────────────────────────────────────╮
 │TAB   q    w    f    p    g        j    l    u    y    :;   BS  │
 │CTL   a    r    s    t    d        h    n    e    i    o    RET │
7│SFT   z    x    c    v    b        k    m    ,    .    /    ◌   │
 │                     ◌    ◌        ◌    ◌                       │
 │          OPT  CMD   M₁   M₃      SFT   ␣   M₂   M₄             │
 ╰────────────────────────────────────────────────────────────────╯
 ╭────────────────────────────────────────────────────────────────╮
 │ ◌    ◌    ◌    ◌    ◌    ◌        ◌    ◌    ◌    ◌    ◌    ◌   │
 │ ◌    ◌    ◌    ◌    ◌    ◌        ◌    ◌    ◌    ◌    ◌    ◌   │
8│ ◌    ◌    ◌    ◌    ◌    ◌        ◌    ◌    ◌    ◌    ◌    ◌   │
 │                     ◌    ◌        ◌    ◌                       │
 │          OPT  CMD   ◌    ◌        ◌    ◌    ◌    ◌             │
 ╰────────────────────────────────────────────────────────────────╯
#+end_example

* Generate Keymap File
#+name: parse_layout
#+begin_src python :var layout=layout :results output 

import re
from more_itertools import chunked
# Remove boxes
lines = [s for s in re.findall(r'\n.│([^│]+)│', layout)]
layers = list(chunked(lines, 5))
layers = ['\n'.join(l) for l in layers]

identity = {'ESC', 'TAB', 'RET', 'F1', 'F2', 'F3', 'F4', 'F5', 'F6', 'F7', 'F8', 'F9', 'F10'}
leftover = []
kp = {
    'CTL': 'LCTRL', 'SFT': 'LSHFT', 'OPT': 'RALT', 'CMD': 'LCMD', ',': 'COMMA', '.': 'DOT',
    '␣': 'SPACE', 'BS': 'BSPC', '/': 'SLASH', '~': 'TILDE', '^': 'CARET', "'": 'SQT',
    '%': 'PERCENT', '|': 'PIPE', '_': 'UNDER', '+': 'PLUS', '"': 'DQT', '$': 'DLLR',
    '&': 'AMPS', '*': 'STAR', '@': 'AT', '!': 'EXCL', '#': 'HASH', ')': 'RPAR',
    '\\': 'BACKSLASH', '=': 'EQUAL', '}': 'RBRC', '`': 'GRAVE', '[': 'LBKT', '>': 'GT',
    '(': 'LPAR', '-': 'MINUS', ']': 'RBKT', '<': 'LT', '{': 'LBRC',
    '→':   'RIGHT',    '←':   'LEFT',     '↓':  'DOWN',      '↑':  'UP',
    'HME': 'HOME',     'END': 'END',      'P↑': 'PGUP',      'P↓': 'PGDN',
    'W←':  'LG(B)',    'W→':  'LG(F)',    'λ←': 'LC(LG(B))', 'λ→': 'LC(LG(F))',
    '¶←':  'LG(LBRC)', '¶→':  'LG(RBRC)', 'S←': 'LG(A)',     'S→': 'LG(E)',
    'UND': 'LC(SLASH)',
    'BEG': 'LG(M)',
    'Bu0': 'LC(LG(N0))',
    'Bu1': 'LC(LG(N1))',
    'Bu2': 'LC(LG(N2))',
    'Bu3': 'LC(LG(N3))',
}
changed = {
    '◌': '&none',
    '◉': '&trans',
    'M₁': '&mo 1',
    'M₂': '&mo 2',
    'M₃': '&mo 3',
    'M₄': '&mo 4',
    'M₅': '&mo 5',
    'M₆!': '&tog 6',
    'BTC': '&bt BT_CLR',
    'BT1': '&bt BT_SEL 0',
    'BT2': '&bt BT_SEL 1',
    'BT3': '&bt BT_SEL 2',
    'BT4': '&bt BT_SEL 3',
    ':;': '&colonsemi',
}

macros = {
    'KIL': ' <&macro_press &kp LCTRL>, <&macro_tap &kp X>, <&macro_release &kp LCTRL>, <&macro_tap &kp X>',
    'SAV': ' <&macro_press &kp LCTRL>, <&macro_tap &kp X &kp S>, <&macro_release &kp LCTRL>',
}

def f(m):
    k = m.group(1)
    if k in macros: return f'&{k}'
    if k in identity: return f'&kp {k}'
    if k in kp: return f'&kp {kp[k]}'
    if k in changed: return f'{changed[k]}'
    if k in 'abcdefghijklmnopqkrstuvwxyz': return f'&kp {k.upper()}'
    if k in '0123456789': return f'&kp N{k}'
    if k in identity: return f'&kp {k}'
    if k[0] == '∫': return f'&kp LS(LC(LA({k[1]})))' # Meh key
    leftover.append(k)
    return f'&none'

sub = lambda s: re.sub(r'(\S+)', f, s)


print("""
/* -*- mode: dts; tab-width: 2; -*-
 ,* Copyright (c) 2021 The ZMK Contributors
 ,*
 ,* SPDX-License-Identifier: MIT
 ,*/

 #include <behaviors.dtsi>
 #include <dt-bindings/zmk/keys.h>
 #include <dt-bindings/zmk/bt.h>

""")

parts = [
    '/ {\nmacros {',
    '\n'.join(f'ZMK_MACRO({k}, wait-ms = <30>; tap-ms = <40>; bindings = {v};)' for k, v in macros.items()),
    '};\n};',
]
print('\n'.join(parts))

print("""
/ {
    behaviors {
      colonsemi: colonsemi {
        compatible = "zmk,behavior-mod-morph";
        label = "COLONSEMI";
        #binding-cells = <0>;
        bindings = <&kp COLON>, <&kp SEMI>;
        mods = <(MOD_LSFT|MOD_RSFT)>;
      };
   };
};
""")

parts = [
    '/ {\nkeymap {\ncompatible = "zmk,keymap"; ',
    '\n\n'.join(f'{i}_layer {{\n bindings = <\n {sub(s)} \n>;\n}};' for i, s in enumerate(layers)),
    '};\n};',
]
print('\n'.join(parts))


#print()
if leftover:
    print(list(leftover))

#+end_src

#+RESULTS: parse_layout
#+begin_example

/* -*- mode: dts; tab-width: 2; -*-
 ,* Copyright (c) 2021 The ZMK Contributors
 ,*
 ,* SPDX-License-Identifier: MIT
 ,*/

 #include <behaviors.dtsi>
 #include <dt-bindings/zmk/keys.h>
 #include <dt-bindings/zmk/bt.h>


/ {
macros {
ZMK_MACRO(KIL, wait-ms = <30>; tap-ms = <40>; bindings =  <&macro_press &kp LCTRL>, <&macro_tap &kp X>, <&macro_release &kp LCTRL>, <&macro_tap &kp X>;)
ZMK_MACRO(SAV, wait-ms = <30>; tap-ms = <40>; bindings =  <&macro_press &kp LCTRL>, <&macro_tap &kp X &kp S>, <&macro_release &kp LCTRL>;)
};
};

/ {
    behaviors {
      colonsemi: colonsemi {
        compatible = "zmk,behavior-mod-morph";
        label = "COLONSEMI";
        #binding-cells = <0>;
        bindings = <&kp COLON>, <&kp SEMI>;
        mods = <(MOD_LSFT|MOD_RSFT)>;
      };
   };
};

/ {
keymap {
compatible = "zmk,keymap"; 
0_layer {
 bindings = <
 &kp TAB   &kp Q    &kp W    &kp E    &kp R    &kp T        &kp Y    &kp U    &kp I    &kp O    &kp P    &kp BSPC  
&kp LCTRL   &kp A    &kp S    &kp D    &kp F    &kp G        &kp H    &kp J    &kp K    &kp L    &colonsemi   &kp RET 
&kp LSHFT   &kp Z    &kp X    &kp C    &kp V    &kp B        &kp N    &kp M    &kp COMMA    &kp DOT    &kp SLASH    &none   
                    &mo 4   &mo 5        &kp N3   &kp LCTRL                      
          &kp RALT  &kp LCMD  &mo 1   &mo 3       &kp LSHFT   &kp SPACE   &mo 2    &none              
>;
};

1_layer {
 bindings = <
  &kp TILDE    &kp EXCL    &kp AT    &kp HASH    &kp DLLR    &kp PERCENT        &kp CARET    &kp N7    &kp N8    &kp N9    &none    &none   
 &none    &kp DQT    &kp AMPS    &kp STAR    &kp UNDER    &kp N0        &kp PLUS    &kp N4    &kp N5    &kp N6    &kp SQT    &kp PIPE   
 &none    &none    &none    &none    &none    &kp DOT        &kp N0    &kp N1    &kp N2    &kp N3    &kp SLASH    &none   
                     &none    &none        &none    &none                       
          &kp RALT  &kp LCMD   &trans    &none        &none    &kp SPACE    &none    &none              
>;
};

2_layer {
 bindings = <
  &kp GRAVE    &none    &none    &none    &none    &none        &none    &none    &none    &none    &none    &kp BSPC  
 &none    &kp LBKT    &kp RBKT    &kp LPAR    &kp RPAR    &none        &none    &kp MINUS    &kp EQUAL    &none    &none    &kp BACKSLASH   
 &none    &kp LT    &kp GT    &kp LBRC    &kp RBRC    &none        &none    &none    &none    &none    &none    &none   
                     &none    &none        &none    &none                       
          &kp RALT  &kp LCMD   &none    &none        &none    &none    &trans    &none              
>;
};

3_layer {
 bindings = <
 &kp ESC  &kp LC(LG(B))   &kp LC(LG(F))   &kp LG(LBRC)   &kp LG(RBRC)    &none        &none   &kp PGUP    &kp UP   &kp PGDN    &none   &kp LC(SLASH)  
 &none   &kp LG(A)   &kp LG(E)   &kp LG(B)   &kp LG(F)   &kp LG(M)       &none    &kp LEFT    &kp DOWN    &kp RIGHT    &none    &none   
 &none    &none    &none    &none    &none    &none        &none   &kp HOME   &none   &kp END   &none    &none   
                     &none    &none        &none    &none                       
          &kp RALT  &kp LCMD  &mo 1    &trans        &none    &none    &none    &none              
>;
};

4_layer {
 bindings = <
  &none    &kp F1   &kp F2   &kp F3   &kp F4   &kp F5      &kp F6   &kp F7   &kp F8   &kp F9   &kp F10  &KIL  
 &none    &kp LS(LC(LA(C)))   &kp LS(LC(LA(D)))   &kp LS(LC(LA(S)))   &kp LS(LC(LA(E)))   &kp LS(LC(LA(P)))      &kp LC(LG(N0))  &kp LC(LG(N1))  &kp LC(LG(N2))  &kp LC(LG(N3))   &none   &SAV  
 &none    &none    &none    &none    &none    &none        &none    &none    &none    &none    &none    &none   
                     &trans    &none        &none    &none                       
          &kp RALT  &kp LCMD   &none   &tog 6       &none    &none    &none    &none              
>;
};

5_layer {
 bindings = <
  &none    &none    &none    &none    &none    &none        &none    &none    &none    &none    &none    &none   
 &none    &none    &none    &none    &none    &none        &none    &none    &none    &none    &none    &none   
 &none    &none    &none    &none    &none    &none        &none    &none    &none    &none    &none    &none   
                     &none    &none        &none    &none                       
          &kp RALT  &kp LCMD   &none    &none        &none    &none    &none    &none              
>;
};

6_layer {
 bindings = <
  &none    &none    &none    &none    &none    &none        &none    &none    &none    &none    &none    &none   
 &none   &bt BT_SEL 3  &bt BT_SEL 2  &bt BT_SEL 1  &bt BT_SEL 0  &bt BT_CLR       &none    &none    &none    &none    &none    &none   
 &none    &none    &none    &none    &none    &none        &none    &none    &none    &none    &none    &none   
                     &none    &none        &none    &none                       
          &kp RALT  &kp LCMD   &none    &trans        &none    &none    &none    &none              
>;
};

7_layer {
 bindings = <
 &kp TAB   &kp Q    &kp W    &kp F    &kp P    &kp G        &kp J    &kp L    &kp U    &kp Y    &colonsemi   &kp BSPC  
&kp LCTRL   &kp A    &kp R    &kp S    &kp T    &kp D        &kp H    &kp N    &kp E    &kp I    &kp O    &kp RET 
&kp LSHFT   &kp Z    &kp X    &kp C    &kp V    &kp B        &kp K    &kp M    &kp COMMA    &kp DOT    &kp SLASH    &none   
                     &none    &none        &none    &none                       
          &kp RALT  &kp LCMD   &mo 1   &mo 3      &kp LSHFT   &kp SPACE   &mo 2   &mo 4              
>;
};

8_layer {
 bindings = <
  &none    &none    &none    &none    &none    &none        &none    &none    &none    &none    &none    &none   
 &none    &none    &none    &none    &none    &none        &none    &none    &none    &none    &none    &none   
 &none    &none    &none    &none    &none    &none        &none    &none    &none    &none    &none    &none   
                     &none    &none        &none    &none                       
          &kp RALT  &kp LCMD   &none    &none        &none    &none    &none    &none              
>;
};
};
};
#+end_example


#+name: generate_zmk_config
#+begin_src python :var layout=parse_layout()
f = open('/Users/guido/Repositories/Experiments/2023-01-18.andean-condor/zmk-config-condor-nicenano/config/boards/shields/andean-condor/andean-condor.keymap', 'w')
f.write(layout)
#+end_src

#+RESULTS: generate_zmk_config
: None

* Layer Status Viewer

This is what discotool json returns for each device:

{'manufacturer': 'ZMK Project',
  'name': 'Andean Condor',
  'ports': [{'dev': '/dev/cu.usbmodem2301', 'iface': ''}],
  'product_id': 24926,
  'serial_num': '23C7B91420F266DF',
  'usb_location': '0x02300000',
  'vendor_id': 7504,
  'version': '',
  'volumes': []}]


#+name: status.py
#+begin_src python :tangle status.py :results value pp
import json, subprocess, serial, re, rich, rich.console, os
from copy import copy
updated = os.stat('layout.txt').st_mtime
from pprint import pprint as pp
from more_itertools import chunked
layers = list(chunked(open('layout.txt').read().split('\n'), 7))
layers = ['\n'.join(l) for l in layers]
layers = [re.sub(r'([│╰╯─╭╮]+)', r'[bold turquoise2]\1[/]', layer) for layer in layers]
layers = [re.sub(r'([◉◌])', r'[dim]\1[/]', layer) for layer in layers]

modifiers = {
    'shift': {
        ' ([abcdefghijklmnopqrstuvwxyz]) ': lambda m: f' {m.group(1).upper()} ',
    },
    'command': {
    },
    'control': {},
    'option': {},
}

# Cool colors:
#    [cyan]
#    [bold cyan]
#    [bold magenta1]
#    [bold green1]
#    [bold turquoise2]
#    [turquoise2]

def msb(n):
    "What is the most significant bit set (also, what is the highest layer set)"
    if not n:
        return 0
    i = 0
    while n:
        n = n >> 1
        i += 1
    return i - 1

p = subprocess.run(['/Users/guido/miniforge3/bin/discotool', 'json'], capture_output=True)
devs = json.loads(p.stdout)
path = [d['ports'][0]['dev'] for d in devs if '23C7B91420F266DF' == d['serial_num']][0]
ser = serial.Serial(path)
con = rich.console.Console(highlight=False)
layer = ''

while s := ser.readline():
    # zmk: set_layer_state: layer_changed: layer 3 state 0
    # GUIDO: layer 4, new state set: 16
    if m := re.search(r'GUIDO: layer (\d+), new state set: (\d+)', s.decode()):
        state = int(m.group(2))
        n = msb(state)
        layer = layers[n]
        con.clear()
        con.print(layer)

        if os.stat('layout.txt').st_mtime > updated:
            updated = os.stat('layout.txt').st_mtime
            layers = json.load(open('layout.txt'))

    if m := re.search(r'GUIDO: Modifiers set to 0x(\d\d)', s.decode()):
        mods = int(m.group(1), 16)

        modified = copy(layer)
        modline = []
        
        if mods & 0x01:
            modifiers['control']
            modline.append('^')
        if mods &0x02:
            for a, b in modifiers['shift'].items():
                modified = re.sub(a, b, modified)
            modline.append('⇧')
        if mods & 0x04:
            modifiers['option']
            modline.append('⌥')
        if mods & 0x08:
            modifiers['command']
            modline.append('⌘')
        if mods & 0x10:
            modifiers['control']
            modline.append('^')
        if mods &0x20:
            modifiers['shift']
            modline.append('⇧')
        if mods & 0x40:
            modifiers['option']
            modline.append('⌥')
        if mods & 0x80:
            modifiers['command']
            modline.append('⌘')
        con.clear()
        con.print(modified)
        con.print(''.join(modline), justify="center")

#+end_src



